'use client'
import { Separator } from '@/components/ui/separator'

export default function HistorySchoolPage() {
  return (
    <div className='container mx-auto px-4 py-8 text-lg'>
      <div className='my-2'>
        <h1 className='font-semibold text-2xl'>Історія школи</h1>
        <Separator />
        <p className='my-2'>
          Історія ліцею починається з дореволюційного часу. Із архівних довідок
          було відновлено відомості про заклад і знайдено, що Смоківка була
          невеликим селищем поблизу Житомира, землі якої належали поміщиці пані
          Довольській. З приходом Жовтневої революції будинок було
          націоналізовано і створено в ньому початкову школу. В школі був лише
          один клас, в якому навчалися діти різного віку. Учителював в ньому
          Онуфрій Миколайович.
        </p>

        <p className='my-2'>
          В кінці 20-их років XX століття школу перевели в приміщення дитячого
          будинку (в якому сьогодні знаходиться педагогічний ліцей). Тут школа
          знаходилась до початку Німецько-радянської війни. В роки війни школа
          була закрита, а після звільнення Житомира була переведена в приміщення
          іншого панського будинку.
        </p>

        <p className='my-2'>
          В 1946 р. відкрита ЗОШ № 10 в приміщенні нинішнього ліцею № 2. Першим
          директором школи після війни був Пасічник Марко Трохимович, а
          заступником — Гонтарж Ядвіга Станіславівна.
        </p>

        <p className='my-2'>
          Восени 1958 року нове приміщення, в якому зараз знаходиться ліцей,
          побудовано і здано в експлуатацію. Його прийняв і очолив педагогічний
          і учнівський колектив на чолі з директором Захарчуком Миколою
          Олександровичем, а завучем залишилася Гонтарж Ядвіга Станіславівна.
        </p>
      </div>
      <div className='my-2'>
        <h1 className='font-semibold text-2xl'>Сьогодення</h1>
        <Separator />

        <p className='my-2'>
          У ліцеї побудовано новий спортзал та медіатеку. Усі кабінети оновлено,
          вони мають сучасний дизайн відповідно до стандартів Нової Української
          Школи. У кожному класі встановлено мультимедійні дошки з проєкторами,
          які активно використовуються вчителями та учнями під час навчання.
        </p>
        <p className='my-2'>
          Станом на 2022 рік загальна кількість учнів — 575, загальна кількість
          класів — 21. У ліцеї відкрито 8 інклюзивних класів.
        </p>
      </div>
      <div className='my-2'>
        <h1 className='font-semibold text-2xl'>Назва</h1>
        <Separator />

        <p className='my-2'>
          До 2022 року ліцей мав назву Загальноосвітня школа І-ІІІ ступенів № 10
          міста Житомира.
        </p>
      </div>
    </div>
  )
}
